In [1]:
import pandas as pd

In [3]:
dataset = pd.read_csv('loan_test.csv')
dataset.head(5)

,Gender,Married,Dependents,Education,Self_Employed,Applicant_Income,Coapplicant_Income,Loan_Amount,Term,Credit_History,Area
0,Male,Yes,0,Graduate,No,572000,0,11000000,360.0,1.0,Urban
1,Male,Yes,1,Graduate,No,307600,150000,12600000,360.0,1.0,Urban
2,Male,Yes,2,Graduate,No,500000,180000,20800000,360.0,1.0,Urban
3,Male,Yes,2,Graduate,No,234000,254600,10000000,360.0,NaN,Urban
4,Male,No,0,Not Graduate,No,327600,0,7800000,360.0,1.0,Urban

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Gender              356 non-null    object
 1   Married             367 non-null    object
 2   Dependents          357 non-null    object
 3   Education           367 non-null    object
 4   Self_Employed       344 non-null    object
 5   Applicant_Income    367 non-null    int64
 6   Coapplicant_Income  367 non-null    int64
 7   Loan_Amount         367 non-null    int64
 8   Term                361 non-null    float64
 9   Credit_History      338 non-null    float64
 10  Area                367 non-null    object
dtypes: float64(2), int64(3), object(6)
memory usage: 31.7+ KB

In [5]:
dataset.isnull().sum()

Gender                11
Married                0
Dependents            10
Education              0
Self_Employed         23
Applicant_Income       0
Coapplicant_Income     0
Loan_Amount            0
Term                   6
Credit_History        29
Area                   0
dtype: int64

In [6]:
dataset['Dependents'].value_counts()

Dependents
0     200
2      59
1      58
3+     40
Name: count, dtype: int64

In [7]:
# filling null values with mode
dataset['Dependents'].fillna(dataset['Dependents'].mode()[0], inplace=True)

C:\Users\asmas\AppData\Local\Temp\ipykernel_19328\983758821.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset['Dependents'].fillna(dataset['Dependents'].mode()[0], inplace=True)

In [8]:
# check
dataset.isnull().sum()

Gender                11
Married                0
Dependents             0
Education              0
Self_Employed         23
Applicant_Income       0
Coapplicant_Income     0
Loan_Amount            0
Term                   6
Credit_History        29
Area                   0
dtype: int64

In [9]:
# now we have to replace 3+ to , we oberved the index no. is 0,1,2,3+so we can change this 3+ into 3 to get better result
dataset['Dependents'].replace('3+','3', inplace =True)

In [10]:
# check
dataset['Dependents'].value_counts()

Dependents
0    210
2     59
1     58
3     40
Name: count, dtype: int64

In [11]:
# 3+ get change into 3 in obejct datatype

In [12]:
# datatype is still same that is object datatype
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Gender              356 non-null    object
 1   Married             367 non-null    object
 2   Dependents          367 non-null    object
 3   Education           367 non-null    object
 4   Self_Employed       344 non-null    object
 5   Applicant_Income    367 non-null    int64
 6   Coapplicant_Income  367 non-null    int64
 7   Loan_Amount         367 non-null    int64
 8   Term                361 non-null    float64
 9   Credit_History      338 non-null    float64
 10  Area                367 non-null    object
dtypes: float64(2), int64(3), object(6)
memory usage: 31.7+ KB

#### Changing datatype

In [13]:
# convert this object datatype into integer datatype or floating datatype.
dataset['Dependents'].astype('int64')

0      0
1      1
2      2
3      2
4      0
      ..
362    3
363    0
364    0
365    0
366    0
Name: Dependents, Length: 367, dtype: int64

In [14]:
# replace with their original position
dataset['Dependents'] = dataset['Dependents'].astype('int64')

In [15]:
# check
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Gender              356 non-null    object
 1   Married             367 non-null    object
 2   Dependents          367 non-null    int64
 3   Education           367 non-null    object
 4   Self_Employed       344 non-null    object
 5   Applicant_Income    367 non-null    int64
 6   Coapplicant_Income  367 non-null    int64
 7   Loan_Amount         367 non-null    int64
 8   Term                361 non-null    float64
 9   Credit_History      338 non-null    float64
 10  Area                367 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 31.7+ KB

#### Dependents datatype get changed to = int64 (integer datatype)